<?
/*////////////////////////////////////////////////////////////
文件生成 ： 2007-04-17
文件性质 ： 提示函数的说明文字文件
编辑： 白月
最后一次更改 ： 2007-05-04  20：30 
*////////////////////////////////////////////////////////////////
$templang = array(    
////////////////////////////////登陆和用户权限相关/////////                       
				"nonlogin" => "您还没有登陆，系统将自动链接到登陆界面！",
				"loginsucess" => "您登陆成功，系统将自动进入首页！"	,
				"loginerror"  => "登陆出现错误，系统将自动返回到登陆界面！",
				"passeditsucess" => "密码修改成功，系统将自动进入用户管理首页！"	,
				"passediterror"  => "密码修改出现错误，系统将自动返回到上一个界面！",
				"nongroup"  => "您的权限不能做此项操作！系统将自动返回上一个页面",
				"alreadylogin" => "您已经登陆，请不要重复登陆，系统将自动返回首页！",
				"exitsucess" => "您已经安全退出本系统，谢谢使用，系统将返回首页！",
				"namepasserror" => "您的用户名或者密码不正确，请再尝试，系统将返回上一个界面！",
				"nonname" => "您的用户名或者密码为空，请重新填写，系统将返回上一个界面！",
				"userstandard" => "你输入的“用户名”不符合规范！系统将自动返回上一个界面",
				"passwordstandard" => "你输入的“密码”不符合规范！系统将自动返回上一个界面",
				"nametong" => "用户名已经被占用，请重新填写，系统将返回上一个界面！",
				"passtesterror" => "两次输入的密码不一致，请重新填写，系统将返回上一个界面！",
				"ypasserror" => "输入的原密码不正确，请重新填写，系统将返回上一个界面！",
				"nonpass" => "您的密码名为空，请重新填写，系统将返回上一个界面！",
				"editnamet" => "用户不能编辑自己，系统将返回上一个界面！",
				"delself" => "用户不能删除自己，系统将返回上一个界面！",
				"useraddsucess"  => "添加用户成功！系统将返回界面！请稍候！",	
				"useradderror"  => "添加用户失败！系统将返回上一个界面！请稍候！",
				

////////////////////////////////数据变更相关/////////  
///////%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
///////////////////////////////数据来源检查和数据增加相关/////////////////////////////////////////
				"addsucess"  => "增加数据成功！系统将返回界面！请稍候！",	
				"adderror"  => "增加数据失败！系统将返回上一个界面！请稍候！",
				"editsucess"  => "编辑数据成功！系统将返回界面！请稍候！",	
				"editerror"  => "编辑数据失败！系统将返回上一个界面！请稍候！",
				"delsucess"  => "删除数据成功！系统将返回管理界面！请稍候！",	
				"delerror"  => "删除数据失败！系统将返回上一个界面！请稍候！",
				"upsucess"  => "数据上传成功！系统将返回管理界面！请稍候！",	
				"uperror"  => "数据上传失败！系统将返回上一个界面！请稍候！",
				"emptytype"  => "有必须填写的数据为空！系统将自动返回上一个界面！",
				"datetong"  => "你输入的数据在数据库中已经存在！系统将自动返回上一个界面！",

				
//////////////////////////////////////////////////////膜色相关				
				"nondata"  => "没有查询到任何数据！系统将自动返回统计页面！",
				"olddate"  => "您的使用授权已经过期！请参照我们的联系方式与我们联系！系统将自动返回首页！",

				
				


		///////////////////////////////公共相关/////////////////////////////////////////
//////%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
///////////////////////////////其他一些检查/////////////////////////////////////////	
			
				"remarkerror" => "你输入的“备注”信息中含有特殊符号，系统将自动返回上一个界面！",
				
				
				
					///////////////////////////////数据来源检查和数据增加相关/////////////////////////////////////////
//////%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
///////////////////////////////其他一些检查/////////////////////////////////////////					
				"openpage"  => "请不要直接打开本页面！系统将自动进入首页！",
				"nonrefresh" => "请不要添加数据后刷新页面，系统将自动返回上一个界面！",	
					
					
					
///////////////////////////////部门相关/////////////////////////////////////////
//////%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
///////////////////////////////其他一些检查/////////////////////////////////////////						
"nonconfig"  => "你的config文件不存在或不可写！请检查！系统将自动返回管理首页",
					
					
					
/////////////////////////////////////////////员工相关/////////////


					
//////////////////////////////////////////////上传相关

			"websetsucess"  => "数据更新成功！系统将返回管理界面！请稍候！",	
			"webseterror"  => "数据更新失败！请检测config.inc.php文件是否可写！",
			"dateerror"  => "你的日期输入不符合规范！请检查！系统将自动返回",
			"upfileerror"  => "不能上传除.DOC .XLS .PPT .RAR .ZIP外的任何文件！！系统将自动返回！",
			"urlfiletong"  => "不能同时选择上传文件和输入路径！！系统将自动返回！",
			"iderror"  => "请检查是否有此文章项目！三秒钟后将自动返回！！",
			"upimageerror"  => "不能上传除JPG、GIF、PNG外的任何文件！！系统将自动返回！",
			"contentempty"  => "需要填写的内容未填写完整，请检查！系统将自动返回",
			"listnumtong"  => "需要填写序号已经存在，请检查！系统将自动返回",
			"listnumerror"  => "需要填写序号输入错误，请检查！系统将自动返回",
			"deltypeerror"  => "存在子项目时，主项目不能删除！",
			
			
		


					
					
					);
					
					
					
?>